[
    {
        "project_class": "1. Bad actors and misinformation on social media",
        "projects": [
            {
                "image": "misinfocovid19",
                "title": "COVID-19 Infodemic: Twitter vs. Facebook",
                "msg": "The global spread of the novel coronavirus is affected by the spread of related misinformation --- the so-called COVID-19 Infodemic --- that makes populations more vulnerable to the disease through resistance to mitigation efforts. In our <a href='https://doi.org/10.1177/20539517211013861' target='_blank'><i class='far fa-file-pdf'></i> paper</a> <b>The COVID-19 Infodemic: Twitter versus Facebook </b> we analyze the prevalence and diffusion of links to low-credibility content about the pandemic across two major social media platforms, Twitter and Facebook. We characterize cross-platform similarities and differences in popular sources, diffusion patterns, influencers, coordination, and automation. Comparing the two platforms, we find divergence among the prevalence of popular low-credibility sources and suspicious videos. A minority of accounts and pages exert a strong influence on each platform. These misinformation \"superspreaders\" are often associated with the low-credibility sources and tend to be verified by the platforms. On both platforms, there is evidence of coordinated sharing of Infodemic content. The overt nature of this manipulation points to the need for societal-level rather than in-house mitigation strategies. However, we highlight limits imposed by inconsistent data-access policies on our capability to study harmful manipulations of information ecosystems."
            },
            {
                "image": "trainnet",
                "title": "Political follow trains on Twitter",
                "msg": "A growing body of evidence points to critical vulnerabilities of social media, such as the emergence of partisan echo chambers and the viral spread of misinformation. We show that these vulnerabilities are amplified by abusive behaviors associated with  so-called 'follow trains' on Twitter, in which long lists of like-minded accounts are mentioned for others to follow. In our recent <a href='https://arxiv.org/abs/2010.13691' target='_blank'><i class='far fa-file-pdf'></i> paper</a> <b>The Manufacture of Partisan Echo Chambers by Follow Train Abuse on Twitter</b>, we present the first systematic analysis of a large U.S. hyper-partisan train network. We observe an artificial inflation of influence: accounts heavily promoted by follow trains profit from a median six-fold increase in daily follower growth. This catalyzes the formation of highly clustered echo chambers, hierarchically organized around a dense core of active accounts. Train accounts also engage in other behaviors that violate platform policies: we find evidence of activity by inauthentic automated accounts and abnormal content deletion, as well as amplification of toxic content from low-credibility and conspiratorial sources. Some train accounts have been active for years, suggesting that platforms need to pay greater attention to this kind of abuse."
            },
            {
                "image": "botperception",
                "title": "Human perceptions of political bots",
                "msg": "Bots are prevalent in online political discussion. In our recent <a href='https://doi.org/10.1177/1461444820942744' target='_blank'><i class='far fa-file-pdf'></i> paper</a>, we examine the perceptions of bots with partisan personas by conducting an experiment with human subjects. Our analysis reveals asymmetrical partisan-motivated reasoning, in that conservative profiles appear to be more confusing and Republican participants perform less well in the recognition task. Moreover, Republican users are more likely to confuse conservative bots with humans, whereas Democratic users are more likely to confuse conservative human users with bots."
            }
        ]

    },
    {
        "project_class": "2. Opioid epidemic in U.S.",
        "projects": [
            {
                "image": "docshopcompare",
                "title": "Assessing prescription drug seeking indicators over ten years of the opioid epidemic",
                "msg": "Prescription drug seeking (PDS) from multiple prescribers is a primary means of obtaining prescription opioids; however, PDS behavior has likely evolved in response to policy shifts, and there is little agreement about how to operationalize it. In our <a href='https://doi.org/10.1111/add.15635' target='_blank'><i class='far fa-file-pdf'></i> paper</a> <b>New means, new measures: Assessing prescription drug seeking indicators over ten years of the opioid epidemic</b> systematically compared the performance of traditional and novel PDS indicators. We find that in the United States, network-based measures appear to have increasing promise for identifying prescription opioid drug seeking behavior, while indicators based on quantity of providers or pharmacies appear to have decreasing utility."
            },
            {
                "image": "pdmp",
                "title": "Evaluating the state policy interventions targeting the opioid epidemic",
                "msg": "Are U.S. state drug policies effective in preventing opioid misuse, opioid use disorder, and drug overdose mortality? In our <a href='https://doi.org/10.1001/jamanetworkopen.2020.36687' target='_blank'><i class='far fa-file-pdf'></i> paper</a> <b>Systematic Evaluation of State Policy Interventions Targeting the US Opioid Epidemic, 2007-2018</b> we find that although existingstate-level drug policies have been associated with a decrease in the misuse of prescription opioids, these policies may have had the unintended consequence of motivating those with opioid use disorders to switch to alternative illicit substances, inducing higher overdose mortality "
            },
            {
                "image": "shopper",
                "title": "Network prominence indicates drug seeking behavior",
                "msg": "Traditional methods for identifying drug seeking patients rely on each individual's medical history. We find that it's beneficial to consider the provider-patient prescription networks, which account for the social processes among the actors. In our <a href='https://doi.org/10.1371/journal.pone.0223849' target='_blank'><i class='far fa-file-pdf'></i> paper</a> <b>Co-prescription network reveals social dynamics of opioid doctor shopping</b> we show that PageRank can be used to effectively identify these drug seekers. However, the naive PageRank algorithm requires one-mode projection on the bipartite network among the providers and patients, which may distort the network topology. In a recent <a href='https://doi.org/10.31235/osf.io/hazvs' target='_blank'><i class='far fa-file-pdf'></i> paper</a> <b>Comparing Measures of Centrality in Bipartite Social Networks: A Study of Drug Seeking for Opioid Analgesics</b> we further demonstrate that the bipartite PageRank algorithms that rank nodes directly on the bipartite networks can better predict high risk patients. <br> We implement the bipartite PageRank algorithms for the community. Our package is available both in Python (<a href='https://pypi.org/project/birankpy/' target='_blank'>birankpy</a>) and R (<a href='https://cran.r-project.org/web/packages/birankr/index.html' target='_blank'>birankr</a>). Source code and documentation can be found on <a href='https://github.com/BrianAronson/birankr'><i class='fab fa-github-square'></i> GitHub</a>."
            }
        ]
    },
    {
        "project_class": "3. Network science",
        "projects": [
            {
                "image": "hypercompare",
                "title": "Systematic comparison of graph embedding methods",
                "msg": "Network embedding techniques aim at representing structural properties of graphs in geometric space. Those representations are considered useful in downstream tasks such as link prediction and clustering.  However, the number of graph embedding methods available on the market is large, and practitioners face the non-trivial choice of selecting the proper approach for a given application. The present work attempts to close this gap of knowledge through a systematic comparison of eleven different methods for graph embedding. We consider methods for embedding networks in the hyperbolic and Euclidean metric spaces, as well as non-metric community-based embedding methods. In our recent <a href='https://link.aps.org/doi/10.1103/PhysRevE.104.044315' target='_blank'><i class='far fa-file-pdf'></i> work</a> <b>Systematic comparison of graph embedding methods in practical tasks</b>, We apply these methods to embed more than one hundred real-world and synthetic networks. Three common downstream tasks --- mapping accuracy, greedy routing, and link prediction --- are considered to evaluate the quality of the various embedding methods. Our results show that some Euclidean embedding methods excel in greedy routing. As for link prediction, community-based and hyperbolic embedding methods  yield overall performance superior than that of Euclidean-space-based approaches. We compare the running time for different methods and further analyze the impact of different network characteristics such as degree distribution, modularity, and clustering coefficients on the quality of the different embedding methods. We release our evaluation framework to provide a standardized benchmark for arbitrary embedding methods."
            },
            {
                "image": "modelfree",
                "title": "Model-free hidden geometry of complex networks",
                "msg": "The fundamental idea of embedding a network in a metric space is rooted in the principle of proximity preservation. Nodes are mapped into points of the space with pairwise distance that reflects their proximity in the network. Popular methods employed in network embedding either rely on implicit approximations of the principle of proximity preservation or implement it by enforcing the geometry of the embedding space, thus hindering geometric properties that networks may spontaneously exhibit. In our <a href='https://doi.org/10.1103/PhysRevE.103.012305' target='_blank'><i class='far fa-file-pdf'></i> paper</a> <b>Model-free hidden geometry of complex networks</b>, we take advantage of a model-free embedding method explicitly devised for preserving pairwise proximity, and characterize the geometry emerging from the mapping of several networks, both real and synthetic. We show that the learned embedding has simple and intuitive interpretations: the distance of a node from the geometric center is representative for its closeness centrality, and the relative positions of nodes reflect the community structure of the network. Proximity can be preserved in relatively low-dimensional embedding spaces and the hidden geometry displays optimal performance in guiding greedy navigation regardless of the specific network topology."
            },
            {
                "image": "persona2vec",
                "title": "Multi-role representations learning",
                "msg": "Most network embedding algorithms assign a single vector to each node, implicitly assuming that a single representation is enough to capture all characteristics of the node. However, across many domains, it is common to observe pervasively overlapping community structure, where most nodes belong to multiple communities, playing different roles depending on the contexts. We propose persona2vec, a graph embedding framework that efficiently learns multiple representations of nodes based on their structural contexts. Checkout our <a href='https://peerj.com/articles/cs-439/' target='_blank'><i class='far fa-file-pdf'></i> paper</a> <b>Persona2vec: A Flexible Multi-role Representations Learning Framework for Graphs</b> and <a href='https://github.com/jisungyoon/persona2vec'><i class='fab fa-github-square'></i> GitHub</a>. "
            }
        ]
    }
]